// Задача необязательная 2:

// В институте биоинформатики по офису передвигается робот. Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату, считает количество программистов в ней и произносит его вслух: "n программистов".

// Для того, чтобы это звучало правильно, для каждого n нужно использовать верное окончание слова.

// Напишите программу, считывающую с пользовательского ввода целое число n (неотрицательное), выводящее это число в консоль вместе с правильным образом изменённым словом "программист", для того, чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.

// В комнате может быть очень много программистов. Проверьте, что ваша программа правильно обработает все случаи, как минимум до 1000 человек.

Console.Clear();
System.Console.WriteLine("Enter the number of programmers.");
int num = Convert.ToInt32(Console.ReadLine());
if (num < 0) System.Console.WriteLine("Incorrect enter.");
else {
    int index1 = (num % 100) / 10;
    int index2 = num % 10;
    string end = "";
    if (index1 == 1) end = "ов";
    else if (index2 == 1);
    else if (index2 == 2 || index2 == 3 || index2 == 4) end = "а";
    else end = "ов";
    System.Console.WriteLine($"{num} программист{end}");
}